USE O_SYDOR_MODULE_3

/* 1. Збільшити на 10 рейтинг всіх постачальників, рейтинг яких в даний момент менший ніж рейтинг постачальника 4 */

BEGIN
	DECLARE @intRating INT
	SET @intRating = (SELECT [rating] FROM [dbo].[suppliers] WHERE [supplierid] = 4)

	UPDATE [dbo].[suppliers]
	  SET [rating] += 10
	  WHERE [rating] < @intRating
END
GO



/* 2. Побудувати таблицю, в якій занесено список номерів виробів, що або знаходяться в Лондоні, 
      або для них поставляються деталі яким-небудь постачальником з Лондона */

SELECT DISTINCT P.[productid]
      ,P.[name]
	INTO [dbo].[tmp_02]
	FROM [dbo].[supplies] AS F
	JOIN [dbo].[suppliers] AS S
	ON S.supplierid = F.supplierid
--	JOIN [dbo].[details] AS D
--	ON D.detailid = F.detailid
	JOIN [dbo].[products] AS P
	ON P.productid = F.productid
	WHERE P.city = 'London'
	OR
	S.city = 'London'

/* 3. Видалити всі вироби, для яких немає поставок деталей */

/* 4. Ñòâîðèòè òàáëèöþ ç íîìåðàìè ïîñòà÷àëüíèê³â ³ ïàðàìè íîìåð³â äåòàëåé, òàêèõ, ùî êîæåí ç ïîñòà÷àëüíèê³â ïîñòàâëÿº îáèäâ³ âêàçàí³ äåòàë³ */

/* 5. Çá³ëüøèòè ðîçì³ð ïîñòàâêè íà 10 â³äñîòê³â äëÿ âñ³õ ïîñòàâîê òèõ ïîñòà÷àëüíèê³â, ÿê³ ïîñòàâëÿþòü ÿêó-íåáóäü ×åðâîíó äåòàëü */

/* 6. Ñòâîðèòè òàáëèöþ  ç êîìá³íàö³ÿìè «êîë³ð äåòàë³ -- ì³ñòî äå çáåð³ãàºòüñÿ äåòàëü» ç âèäàëåííÿì äóáë³êàò³â */

/* 7. Çàíåñòè â íîâîñòâîðåíó òàáëèöþ ñïèñîê íîìåð³â äåòàëåé, ÿê³ ïîñòàâëÿþòüñÿ 
      áóäü-ÿêèì ïîñòà÷àëüíèêîì ç Ëîíäîíà ÷è äëÿ áóäü-ÿêîãî âèðîáó ç Ëîíäîíà */

/* 8. Âñòàâèòè â òàáëèöþ ïîñòà÷àëüíèê³â ïîñòà÷àëüíèêà ç êîäîì 10, ïð³çâèùåì Óàéò, ç ì³ñòà Íüþ-Éîðê ç íåâ³äîìèì ðåéòèíãîì  */

/* 9. Âèäàëèòè âñ³ âèðîáè ç Ðèìó ³ âñ³ â³äïîâ³äí³ ïîñòàâêè */

/* 10. Ñòâîðèòè òàáëèöþ ç âïîðÿäêîâàíèì ñïèñêîì âñ³õ ì³ñò â ÿêèõ º ïî êðàéí³é ì³ð³ îäèí ïîñòà÷àëüíèê, îäíà äåòàëü ÷è âèð³á */

/* 11. Çì³íèòè êîë³ð ÷åðâîíèõ äåòàëåé ç âàãîþ ìåíøå 15 ôóíò³â íà æîâòèé. */

/* 12. Ñòâîðèòè òàáëèöþ ç íîìåðàìè âèðîá³â ³ íàçâàìè ì³ñò, äå âîíè âèãîòîâëÿþòüñÿ. Äîäàòêîâà óìîâà – äðóãà ë³òåðà íàçâà ì³ñòà ïîâèííà áóòè ‘î’ */

/* 13. Çá³ëüøèòè íà 10 ðåéòèíã òèõ ïîñòà÷àëüíèê³â, îá’ºì ïîñòàâîê ÿêèõ âèùå ñåðåäíüîãî */

/* 14. Ñòâîðèòè òàáëèöþ ç âïîðÿäêîâàíèìè ñïèñêàìè íîìåð³â ³ ïð³çâèùàìè ïîñòà÷àëüíèê³â, ÿê³ ïîñòà÷àþòü äåòàë³ äëÿ âèðîáó 1. */

/* 15. Âñòàâèòè â òàáëèöþ äâîõ ð³çíèõ ïîñòà÷àëüíèê³â îäíîþ êîìàíäîþ */